[
  {
    "id": "modal1",
    "title": "Lumen — Brand Identity & Digital Style System",
    "coverImage": "assets/lumen-cover.jpg",
    "frames": [
      {
        "section": "Overview",
        "text": "Lumen is a sustainability-focused lifestyle startup that creates eco-friendly home products for urban millennials. Scope: develop a complete brand identity system, including logo redesign, typography, color system, brand guidelines, applications across packaging, website, and social media, plus a digital style guide.",
        "image": "assets/lumen-overview.jpg",
        "note": "Use a clean banner or title card here."
      },
      {
        "section": "Problem",
        "text": "Lumen launched quickly with a DIY logo and inconsistent visual style. The brand struggled with an outdated logo, inconsistent typography and color palette across digital and physical touchpoints, and weak differentiation in a crowded eco-lifestyle market.",
        "image": "assets/lumen-problem.jpg",
        "note": "Show old logo or placeholder comparison."
      },
      {
        "section": "Research",
        "text": "Market research revealed that competitors leaned heavily on green tones and nature motifs, creating visual sameness. Successful eco-brands balanced minimalism with warmth.",
        "image": "assets/lumen-research.jpg",
        "note": "Collage of personas, competitor brands, and moodboard."
      },
      {
        "section": "Design Goals",
        "text": "1. Modernize identity to feel premium yet approachable. 2. Establish a cohesive system adaptable across digital and physical assets. 3. Differentiate from green-heavy branding clichés. 4. Create scalable guidelines for web, packaging, and social channels.",
        "image": "assets/lumen-goals.jpg",
        "note": "Use icon set or simple graphic to show 4 goals."
      },
      {
        "section": "Process",
        "text": "Logo development explored wordmark concepts emphasizing clarity and geometry. Final design: a clean sans-serif logotype with a circular accent symbolizing renewal and cycles of sustainability.",
        "image": "assets/lumen-process.jpg",
        "note": "Include logo sketches, typography system, and palette graphic."
      },
      {
        "section": "Applications",
        "text": "Applied the system across packaging, website, and social. Packaging: minimal layouts with terracotta accents for hierarchy. Website: clean grid, editorial typography, lifestyle photography.",
        "image": "assets/lumen-applications.jpg",
        "note": "Show packaging mockup, website screens, and Instagram grid."
      },
      {
        "section": "Deliverables",
        "text": "Final outputs included the logo system (primary, icon, monochrome), typography and color guidelines, full brand guidelines PDF, packaging mockups, website homepage and product page.",
        "image": "assets/lumen-deliverables.jpg",
        "note": "Hero-style montage of all deliverables."
      },
      {
        "section": "Impact",
        "text": "Projected brand recognition increase: +40% through consistent, distinct visuals. Website redesign estimated to improve clarity of product categories and reduce bounce rate by 25–30%.",
        "image": "assets/lumen-impact.jpg",
        "note": "Add metrics graphics and testimonial card."
      },
      {
        "section": "Reflection",
        "text": "This project reinforced the importance of balancing strategy with aesthetics—avoiding clichés while still signaling sustainability. With more time, I would extend the system into motion design for social reels and product demo videos.",
        "video": "assets/lumen-reflection.mp4",
        "note": "Keep this minimal with a soft visual background."
      }
    ],
    "tech": ["Illustrator", "Photoshop", "Figma", "InDesign"],
    "demoUrl": "#",
    "sourceUrl": "#"
  },
  {
    "id": "modal2",
    "title": "FixOFF – AI-Driven Branding & Digital Experience",
    "coverImage": "assets/fixoff-cover.jpg",
    "frames": [
      {
        "section": "Overview",
        "text": "FixOFF is an experimental entertainment collective producing genre-blending music. The project scope included a full AI-driven rebrand: brand identity, website concept, mobile music app UI, and packaging/social visuals.",
        "image": "assets/fixoff-overview.jpg",
        "note": "Use a clean banner or title card here."
      },
      {
        "section": "Problem",
        "text": "FixOFF's existing branding was minimal and generic, making it difficult to stand out in the crowded digital music space. Their outdated website lacked interactivity, and they struggled to resonate with AI-native younger audiences.",
        "image": "assets/fixoff-problem.jpg",
        "note": "Insert 'before' screenshot if you have one, else placeholder."
      },
      {
        "section": "Research",
        "text": "User personas highlighted Gen Z listeners seeking immersive aesthetics and indie creators resonating with experimental visuals. Surveys showed demand for authenticity and uniqueness.",
        "image": "assets/fixoff-research.jpg",
        "note": "Collage of personas/moodboard works well here."
      },
      {
        "section": "Applications",
        "text": "Final designs applied across web, mobile app UI, vinyl/digital packaging, and social media branding. Website featured adaptive AI visuals responding to music moods.",
        "image": "assets/fixoff-applications.jpg",
        "note": "Full-screen mockups look good here."
      },
      {
        "section": "Impact",
        "text": "Projected outcomes included +30% increase in engagement, stronger brand recognition on social platforms, and an estimated 25% reduction in website bounce rate.",
        "image": "assets/fixoff-impact.jpg",
        "note": "Use metric graphics or testimonial cards."
      }
    ],
    "tech": ["MidJourney", "Stable Diffusion", "Figma", "After Effects"],
    "demoUrl": "#",
    "sourceUrl": "#"
  },
  {
    "id": "modal3",
    "title": "Aurora Tea Co. – Digital Content Campaign",
    "coverImage": "assets/auroratea-cover.jpg",
    "frames": [
      {
        "section": "Overview",
        "text": "Aurora Tea Co. is a boutique tea brand in Singapore specializing in organic blends from sustainable farms. The project scope was to design a cross-platform creative campaign covering social media visuals, a campaign landing page, and refreshed packaging concepts.",
        "image": "assets/auroratea-overview.jpg",
        "note": "Use a clean banner or title card here."
      },
      {
        "section": "Problem",
        "text": "The company struggled with low digital engagement (<1% interaction on Instagram), fragmented branding across channels, and limited reach among younger audiences.",
        "image": "assets/auroratea-problem.jpg",
        "note": "Insert 'before' screenshot if you have one, else placeholder."
      },
      {
        "section": "Applications",
        "text": "Final applications included Instagram carousel sets, TikTok reels, story templates, landing page mockups with shop integration, and packaging prototypes with distinct color codes per blend.",
        "image": "assets/auroratea-applications.jpg",
        "note": "Full-screen mockups look good here."
      }
    ],
    "tech": ["Photoshop", "Illustrator", "Figma", "After Effects"],
    "demoUrl": "#",
    "sourceUrl": "#"
  },
  {
    "id": "modal4",
    "title": "FlowBank Mobile App Redesign",
    "coverImage": "assets/flowbank-cover.jpg",
    "frames": [
      {
        "section": "Overview",
        "text": "FlowBank is a digital bank in Southeast Asia targeting young professionals and freelancers. The project scope involved a full mobile app redesign, including UX research, user flow reorganization, wireframes, high-fidelity UI design, and creation of a design system.",
        "image": "assets/flowbank-overview.jpg",
        "note": "Use a clean banner or title card here."
      },
      {
        "section": "Problem",
        "text": "FlowBank's mobile app was outdated, cluttered, and difficult to navigate. Users struggled to find transaction history, engagement with savings features was low, and the visual style no longer matched modern fintech standards.",
        "image": "assets/flowbank-problem.jpg",
        "note": "Insert 'before' screenshot if you have one, else placeholder."
      },
      {
        "section": "Impact",
        "text": "Hypothetical results: app abandonment reduced by 30%, savings goal usage increased by 45%, and user satisfaction rose from 3.2 to 4.5 stars.",
        "image": "assets/flowbank-impact.jpg",
        "note": "Use metric graphics or testimonial cards."
      }
    ],
    "tech": ["Figma", "Adobe Illustrator", "UserTesting", "Prototyping"],
    "demoUrl": "#",
    "sourceUrl": "#"
  },
  {
    "id": "modal5",
    "title": "Pulsewave Motion Graphics Intro",
    "coverImage": "assets/companyname-cover.jpg",
    "frames": [
      {
        "section": "Overview",
        "text": "Pulsewave Music Festival is a fictional annual electronic music festival attracting 20,000+ attendees. The scope of this project was to design and animate a short event intro video, motion logo, and teaser clips for social media.",
        "image": "assets/companyname-overview.jpg",
        "note": "Use a clean banner with the Pulsewave logo and neon festival theme."
      },
      {
        "section": "Problem",
        "text": "The festival had strong static branding on posters and merchandise, but their video content felt outdated and failed to capture the scale and excitement of the event.",
        "image": "assets/companyname-problem.jpg",
        "note": "Insert 'before' placeholder showing flat/static poster or image."
      }
    ],
    "tech": ["After Effects", "Premiere Pro", "Photoshop", "Illustrator"],
    "demoUrl": "#",
    "sourceUrl": "#"
  },
  {
    "id": "modal6",
    "title": "Crochet by Alia Fazil",
    "coverImage": "assets/crochetbyaliafazil-cover.jpg",
    "frames": [
      {
        "section": "Overview",
        "text": "Crochet by Alia Fazil is a personal handmade crochet brand specializing in cozy, handcrafted products. The project involved developing a complete brand identity system—logo, color palette, typography, packaging, and digital presence.",
        "image": "assets/crochetbyaliafazil-overview.jpg",
        "note": "Use a clean banner with logo + hero mockup (e.g., tote bag, product shot)."
      },
      {
        "section": "Problem",
        "text": "While orders were steady, the brand lacked a consistent visual identity. Social media posts felt disconnected, packaging was generic, and the brand struggled to differentiate itself from other handmade shops.",
        "image": "assets/crochetbyaliafazil-problem.jpg",
        "note": "Show examples of unbranded/old posts vs blank product packaging."
      }
    ],
    "tech": ["Adobe Illustrator", "Photoshop", "Canva"],
    "demoUrl": "#",
    "sourceUrl": "#"
  }
]
